In [30]:
import numpy as np
import pandas as pd

4.1.1
(1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

In [18]:
eng = pd.Series([50, 20], index = ['Eugene', 'Katherine'])
math = pd.Series([32, 40], index = ['Katherine', 'Jeon'])
eng, math

(Eugene       50
 Katherine    20
 dtype: int64,
 Katherine    32
 Jeon         40
 dtype: int64)

(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [19]:
eng + math, eng - math, eng * math, eng / math

(Eugene        NaN
 Jeon          NaN
 Katherine    52.0
 dtype: float64,
 Eugene        NaN
 Jeon          NaN
 Katherine   -12.0
 dtype: float64,
 Eugene         NaN
 Jeon           NaN
 Katherine    640.0
 dtype: float64,
 Eugene         NaN
 Jeon           NaN
 Katherine    0.625
 dtype: float64)

4.1.2 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [20]:
data = {
    'int' : [1, 2, 3, 4, 5],
    'float' : [1.1, 2.2, 3.3, 4.4, 5.5],
    'str' : ['a', 'b', 'c', 'd', 'e'],
    'colour' : ['red', 'orange','yellow', 'green','blue'],
    'year' : [1980, 1990, 2000, 2010, 2020]
}
columns = ['int', 'float','str','colour','year']
index = ['i','wanna','go','home','now']
df = pd.DataFrame(data, index = index, columns = columns)
df

       int  float str  colour  year
i        1    1.1   a     red  1980
wanna    2    2.2   b  orange  1990
go       3    3.3   c  yellow  2000
home     4    4.4   d   green  2010
now      5    5.5   e    blue  2020

4.1.3 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [21]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [22]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df.수학

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [23]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [24]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df["평균"] = ((df['국어'] + df['영어'] + df['수학']) / 3) # df.mean(axis = 1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [25]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df.iloc[3,1] = 80
df["평균"] = ((df['국어'] + df['영어'] + df['수학']) / 3)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [26]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df[:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [27]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

4.3.1 1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

In [39]:
nickname = {
    'Elizabeth' : ['liz','lizy','beth','eliza','betty'],
    'Katherine' : ['kate','kat','katty','katie','rina'],
    'Alexander' : ['alex','lexy','lex','xander','alexie'],
    'Benjamin' : ['ben', 'benjie','bennie','minny','jamin'],
    'Nicolas' : ['nick','nicky','las','lasie','col']
}
columns = ['Elizabeth', 'Katherine', 'Alexander','Benjamin','Nicolas']
index = ['i','wanna','go','home','now']
df = pd.DataFrame(nickname, columns = columns, index = index)
df

      Elizabeth Katherine Alexander Benjamin Nicolas
i           liz      kate      alex      ben    nick
wanna      lizy       kat      lexy   benjie   nicky
go         beth     katty       lex   bennie     las
home      eliza     katie    xander    minny   lasie
now       betty      rina    alexie    jamin     col

2. 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [41]:
df["Elizabeth"]['i'], df.loc['i', 'Elizabeth'], df.iloc[0, 0], df[:1], df["Elizabeth"]

('liz',
 'liz',
 'liz',
   Elizabeth Katherine Alexander Benjamin Nicolas
 i       liz      kate      alex      ben    nick,
 i          liz
 wanna     lizy
 go        beth
 home     eliza
 now      betty
 Name: Elizabeth, dtype: object)

In [110]:
df[:1], df["Elizabeth"], df.loc['i'], df.loc['i'], df.Elizabeth,\
    df.loc[:'wanna',:'Katherine'], df.loc[df.Elizabeth == 'beth'], df.iloc[0], df.iloc[:1,:1],\
        df.loc[:'wanna', 'Elizabeth' : 'Katherine']

(  Elizabeth Katherine Alexander Benjamin Nicolas
 i       liz      kate      alex      ben    nick,
 i          liz
 wanna     lizy
 go        beth
 home     eliza
 now      betty
 Name: Elizabeth, dtype: object,
 Elizabeth     liz
 Katherine    kate
 Alexander    alex
 Benjamin      ben
 Nicolas      nick
 Name: i, dtype: object,
 Elizabeth     liz
 Katherine    kate
 Alexander    alex
 Benjamin      ben
 Nicolas      nick
 Name: i, dtype: object,
 i          liz
 wanna     lizy
 go        beth
 home     eliza
 now      betty
 Name: Elizabeth, dtype: object,
       Elizabeth Katherine
 i           liz      kate
 wanna      lizy       kat,
    Elizabeth Katherine Alexander Benjamin Nicolas
 go      beth     katty       lex   bennie     las,
 Elizabeth     liz
 Katherine    kate
 Alexander    alex
 Benjamin      ben
 Nicolas      nick
 Name: i, dtype: object,
   Elizabeth
 i       liz,
       Elizabeth Katherine
 i           liz      kate
 wanna      lizy       kat)

4.4.1 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [42]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [112]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

4.4.2 sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [126]:
titanic.sex.value_counts()

male      577
female    314
Name: sex, dtype: int64

In [127]:
titanic.age.value_counts()

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64

In [128]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [129]:
titanic.alive.value_counts()

no     549
yes    342
Name: alive, dtype: int64

4.4.3 1. 타이타닉호 승객의 평균 나이를 구하라.

In [134]:
titanic.age.mean()

29.69911764705882

In [140]:
# 2. 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
titanic[titanic.sex == 'female'].age.mean()

27.915708812260537

In [153]:
# 3. 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
t = titanic[titanic.sex == 'female']
t[t['class'] == 'First'].age.mean()

34.61176470588235

4.4.4 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.

20살이 넘으면 성별을 그대로 사용한다.

20살 미만이면 성별에 관계없이 “child”라고 한다.

In [43]:
titanic["category1"] = titanic.apply(lambda r: "child" if r.age < 20 else r.sex, axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

4.4.5 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [44]:
titanic['age'] = titanic.age.fillna(titanic.age.mean())
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

4.4.6 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.

1. 성별을 나타내는 문자열 male 또는 female로 시작한다.

2. 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.

3. 예를 들어 27살 남성은 male27 값이 된다.

In [45]:
titanic["category2"] = titanic.apply(lambda r: (str(r.sex) + str(r.age)), axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,male22.0
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,female38.0
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,female26.0
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,female35.0
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,male35.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,male27.0
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,female19.0
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female,female29.69911764705882
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,male26.0
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,male32.0

4.4.7 타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다. 그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [274]:
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic['gen'] = pd.cut(titanic.age, bins, labels=labels)
underage = titanic[titanic.gen == '미성년자'].gen.count() / titanic.gen.count()
youth = titanic[titanic.gen == '청년'].gen.count() / titanic.gen.count()
middleage = titanic[titanic.gen == '중년'].gen.count() / titanic.gen.count()
elder = titanic[titanic.gen == '장년'].gen.count() / titanic.gen.count()
grand = titanic[titanic.gen == '노년'].gen.count() / titanic.gen.count()
underage + youth + middleage + elder + grand

1.0

4.4.8 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.

1. 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.

2. 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.

In [281]:
titanic["category3"] = titanic.apply(lambda r: "미성년자" if r.age < 20 else (str(r.gen) + '여성') if r.sex == 'female' else (str(r.gen) + '남성'), axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2,gen,category3
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,male22.0,청년,청년남성
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,female38.0,중년,중년여성
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,female26.0,청년,청년여성
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,female35.0,중년,중년여성
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,male35.0,중년,중년남성
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,male27.0,청년,청년남성
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,female19.0,미성년자,미성년자
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,female,female29.69911764705882,청년,청년여성
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,male26.0,청년,청년남성
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,male32.0,중년,중년남성

4.5.1 5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

1. 학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.

In [349]:
score = {
    'name' : ['i','wanna','go','home','now'],
    'korean' : [39, 28, 32, 75, 46],
    'english' : [56, 46, 46, 34, 37],
    'math' : [56, 76, 54, 75, 45]
}
df_score1 = pd.DataFrame(score)
df_score1.set_index('name')
df_score2 = df_score1.reset_index(drop = True)
df_score2

    name  korean  english  math
0      i      39       56    56
1  wanna      28       46    76
2     go      32       46    54
3   home      75       34    75
4    now      46       37    45

2. 학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.

In [350]:
df_score2.set_index('name')

       korean  english  math
name
i          39       56    56
wanna      28       46    76
go         32       46    54
home       75       34    75
now        46       37    45

4.5.2 A반 학생 5명과 B반 학생 5명의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.

In [39]:
# 1. “반”, “번호”, “국어”, “영어”, “수학” 을 열로 가지는 데이터프레임 df_score3을 만든다.
score = {
    '반' : ['A','A','A','A','A','B','B','B','B','B'],
    '번호' : [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    '국어' : [39, 28, 32, 75, 46, 69, 78, 65, 35, 64],
    '영어' : [56, 46, 46, 34, 37, 87, 78, 6, 54, 56],
    '수학' : [56, 76, 54, 75, 45, 80, 97, 56, 98, 21]
}
df_score3 = pd.DataFrame(score)

In [43]:
# 2. df_score3을 변형하여 1차 행 인덱스로 “반”을 2차 행 인덱스로 “번호”을 가지는 데이터프레임 df_score4을 만든다.
df_score4 = df_score3.set_index(['반', '번호'])
df_score4

      국어  영어  수학
반 번호
A 1   39  56  56
  2   28  46  76
  3   32  46  54
  4   75  34  75
  5   46  37  45
B 6   69  87  80
  7   78  78  97
  8   65   6  56
  9   35  54  98
  10  64  56  21

In [52]:
# 3. 데이터 프레임 df_score4에 각 학생의 평균을 나타내는 행을 오른쪽에 추가한다.
df_score4["평균"] = ((df_score4['국어'] + df_score4['영어'] + df_score4['수학']) / 3)
df_score4

      국어  영어  수학         평균
반 번호
A 1   39  56  56  50.333333
  2   28  46  76  50.000000
  3   32  46  54  44.000000
  4   75  34  75  61.333333
  5   46  37  45  42.666667
B 6   69  87  80  78.666667
  7   78  78  97  84.333333
  8   65   6  56  42.333333
  9   35  54  98  62.333333
  10  64  56  21  47.000000

In [47]:
# 4. df_score3을 변형하여 행 인덱스로 “번호”를, 1차 열 인덱스로 “국어”, “영어”, “수학”을, 2차 열 인덱스로 “반”을 가지는 데이터프레임 df_score5을 만든다.

In [ ]:
# 5. 데이터 프레임 df_score5에 각 반별 각 과목의 평균을 나타내는 행을 아래에 추가한다.